In [1]:
import pandas as pd

In [2]:
# Create first DataFrame: Customer Information
customers = pd.DataFrame({
    'customer_id': [1, 2, 3, 4, 5],
    'name': ['Alice', 'Bob', 'Charlie', 'David', 'Emma'],
    'age': [25, 30, 35, 40, 28],
    'city': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Boston']
})

# Create second DataFrame: Orders
orders = pd.DataFrame({
    'order_id': [101, 102, 103, 104, 105, 106],
    'customer_id': [1, 2, 2, 3, 5, 6],  # Note: customer_id 6 has no match in customers
    'product': ['Laptop', 'Phone', 'Tablet', 'Monitor', 'Keyboard', 'Mouse'],
    'amount': [1000, 800, 300, 250, 100, 50]
})

In [4]:
def fun(group):
    return group - 1000


df = pd.merge(customers, orders, on='customer_id', how='left')
df['amount'].apply(fun)

0      0.0
1   -200.0
2   -700.0
3   -750.0
4      NaN
5   -900.0
Name: amount, dtype: float64

In [5]:
df

   customer_id     name  age         city  order_id   product  amount
0            1    Alice   25     New York     101.0    Laptop  1000.0
1            2      Bob   30  Los Angeles     102.0     Phone   800.0
2            2      Bob   30  Los Angeles     103.0    Tablet   300.0
3            3  Charlie   35      Chicago     104.0   Monitor   250.0
4            4    David   40      Houston       NaN       NaN     NaN
5            5     Emma   28       Boston     105.0  Keyboard   100.0

In [9]:
df[df['city'].isin(['New York', 'Boston'])][['name', 'age']]

    name  age
0  Alice   25
5   Emma   28

In [6]:
pd.concat([customers, orders], ignore_index=True)

    customer_id     name   age         city  order_id   product  amount
0             1    Alice  25.0     New York       NaN       NaN     NaN
1             2      Bob  30.0  Los Angeles       NaN       NaN     NaN
2             3  Charlie  35.0      Chicago       NaN       NaN     NaN
3             4    David  40.0      Houston       NaN       NaN     NaN
4             5     Emma  28.0       Boston       NaN       NaN     NaN
5             1      NaN   NaN          NaN     101.0    Laptop  1000.0
6             2      NaN   NaN          NaN     102.0     Phone   800.0
7             2      NaN   NaN          NaN     103.0    Tablet   300.0
8             3      NaN   NaN          NaN     104.0   Monitor   250.0
9             5      NaN   NaN          NaN     105.0  Keyboard   100.0
10            6      NaN   NaN          NaN     106.0     Mouse    50.0

In [7]:
pd.pivot_table(  # Talvez um dia 
    df, 
     index='customer_id',
     columns='product',
     values='amount',
     aggfunc='sum'
)

product      Keyboard  Laptop  Monitor  Phone  Tablet
customer_id
1                 NaN  1000.0      NaN    NaN     NaN
2                 NaN     NaN      NaN  800.0   300.0
3                 NaN     NaN    250.0    NaN     NaN
5               100.0     NaN      NaN    NaN     NaN